In [14]:
import pandas as pd
import numpy as np

In [15]:
dic={"name":["sila","nur","ali","kemal"],
     "department":["software","hardware","marketing","hardware"],
     "salary":[200,300,400,500]}

df=pd.DataFrame(dic)
#df nin içine data index ve columns ayarlayıp öyle yazabilirsin
df

    name department  salary
0   sila   software     200
1    nur   hardware     300
2    ali  marketing     400
3  kemal   hardware     500

In [16]:
df["department"].unique()

array(['software', 'hardware', 'marketing'], dtype=object)

In [17]:
df["department"].nunique()
#number of unique departmanlar

3

In [18]:
df["department"].value_counts()

department
hardware     2
software     1
marketing    1
Name: count, dtype: int64

In [19]:
def grossSalToNetSal(salary):
    return salary*0.66

df["salary"].apply(grossSalToNetSal)
#.apply metodu ile fonksiyonu o columna uyguladık

0    132.0
1    198.0
2    264.0
3    330.0
Name: salary, dtype: float64

In [20]:
df.isnull()

    name  department  salary
0  False       False   False
1  False       False   False
2  False       False   False
3  False       False   False

In [21]:
newData={"char class":["south park","simpson","south park","simpson"],
         "char name":["cartman","carc","kenny","homer"],
         "char age":[9,10,50,20]}

df2=pd.DataFrame(newData)
df2

   char class char name  char age
0  south park   cartman         9
1     simpson      carc        10
2  south park     kenny        50
3     simpson     homer        20

In [22]:
df2.pivot_table(values="char age",index=["char class","char name"])

                      char age
char class char name
simpson    carc           10.0
           homer          20.0
south park cartman         9.0
           kenny          50.0

In [23]:
#eger üstte simpson homerdan bi tane daha olsa yaşı da 10 olsa, 20 ve 10 un ortalamasını alır ve sonuca yazardı pivot table da
#ister toplatırsın ister ort aldırırsın
#en sona bi parametre daha eklersin aggfunc=np.sum() gibi

In [27]:
#bir örnek daha yapalım


dict2={"course":["math","math","chemistry","physics","physics"],
       "totalStdNum":[40,30,15,32,23],
       "hours":[3,4,3,2,4]}

df3=pd.DataFrame(dict2)
df3

      course  totalStdNum  hours
0       math           40      3
1       math           30      4
2  chemistry           15      3
3    physics           32      2
4    physics           23      4

In [28]:
df3["course"].unique()

array(['math', 'chemistry', 'physics'], dtype=object)

In [29]:
df3["course"].nunique()

3

In [31]:
df3["course"].value_counts()

course
math         2
physics      2
chemistry    1
Name: count, dtype: int64

In [33]:
#map(func_adi,uygulanacak_veri_tipi) fonksiyonunda olduğu gibi bir fonksiyonu tüm dataframe e kısayoldan uygulayabilmenin bir yolu var
#apply fonk ile mevcut işlemi tüm df üzerine uygulayabiliriz

def func(hours):
    return hours*2

df3["hours"].apply(func)

0    6
1    8
2    6
3    4
4    8
Name: hours, dtype: int64

In [34]:
df3.isnull()

   course  totalStdNum  hours
0   False        False  False
1   False        False  False
2   False        False  False
3   False        False  False
4   False        False  False

In [35]:
df.isnull().sum()

name          0
department    0
salary        0
dtype: int64

In [36]:
#yeni bir df oluşturup pivot table örnegi yapalim
#multiindexle benzer görevi görür ama aynı elemandan 1 den fazla varsa onları da tek çatı altında toplar


footballers={"teamName":["gs","gs","gs","gs","fb","fb","bjk"],
             "name":["ali","ali","veli","veli","veli","deli","mehmet"],
             "age":[20,30,30,35,40,23,22]}


df4=pd.DataFrame(footballers)
df4

  teamName    name  age
0       gs     ali   20
1       gs     ali   30
2       gs    veli   30
3       gs    veli   35
4       fb    veli   40
5       fb    deli   23
6      bjk  mehmet   22

In [37]:
df4.pivot_table(values="age",index=["teamName","name"])

                  age
teamName name
bjk      mehmet  22.0
fb       deli    23.0
         veli    40.0
gs       ali     25.0
         veli    32.5